nums = [5, 7, 3, 1, 9, True, "Hello", [5, 2]]             # [] - означає що це список де можна вписати багато значень
nums[0] = 50
nums[5] = 2                                             # індекси починаються від 0 по черзі

print(nums[3])                                               # використовуються всі типи даних
print(nums[-1])                               # [-1] останній елемент із списку
print(nums[7][1])                              # вибираємо число з ще одного списку


numbers = [5, 1, 7]
#numbers[3] = 100
numbers.append(100)                       #append добавлення елемента в список(в кінці)
numbers.insert(1, True)                   #insert розміщення елемента в определьонний індекс
                                          # (місце де буде елемент, елемент який будемо розміщати

b = [3, 2, 1]
numbers.extend(b)                         #extend розміщення сразу декілька елементів в кінець
numbers.sort()                            #sort сортіровка еелментів з нищого до більшого(True=1, False=0)
numbers.reverse()                         #reverse переварачує список перший елемент на останнє місце а останній на перше

numbers.pop()                             #pop видаляє останній елемент
numbers.remove(2)                         #remove видалення певного елементу
numbers.pop(-1)
#numbers.clear()   -  очищає весь список

print(numbers)
print(numbers.count(5))                    #count щитає скільки елементів в цьому списку
print(len(numbers))                       #len() длінна списку


num = [5, 1, 3, "22", False]

for el in nums:
    el *= 2                      #умноження елементів на 2 (False = 0, 0*2=0)
    print(el)                     #виведення всіх елементів з списку



n = int(input("Enter lens :"))

user_list = []
i = 0
while i < n:
    string = "Enter element #" + str(i + 1) + ":"
    user_list.append(input(string))
    i += 1
print(user_list)

# програма де ми будемо просити число і потім будемо создавати цикл який буде йти від 0 до числа пользователя
# і в цьому циклі кожен раз до пустого списку будемо добавляти новий елемент і цей елемент будемо получати від
# пользователя потім будемо наш індекс збільшувати на 1, пройдемося по списку добавим кожен елемент і виведем його

